#4. Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,…
# Количество элементов (n) вводится с клавиатуры.

n = int(input("введите число(n)\n "
              "элементов ряда 1, -0.5, 0.25, -0.125 ...\n  "
              "a(i), a(i+1)= a(i)/(-2), a(i+2) = a(i+1)/(-2)... : "))
a = 1
enumerator = 0
sum = 0
while enumerator != n:
    sum += a
    a = a/(-2)
    enumerator +=1
print (f'Сумма {n}-элементов равна :{sum}')
